<?php
namespace app\common\widget;
//|***************************************************************
//|lnbei
//+---------------------------------------------------------------
//|Copyright (c) 2006~2099 http://lnbei.net All rights reserved.
//+---------------------------------------------------------------
//|Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
//+---------------------------------------------------------------
//|@auth zhuoyue(993238441@qq.com)
//+---------------------------------------------------------------
//|用户页面编辑类
//|***************************************************************
 class PageUser
{
    public $ID;//ID
    public $userID;//用户ID
    public $fileName;//文件名称
    public $fileContent;//文件内容
    public $state;//状态0:已保存1：正在编辑
}

?>